app/controllers/albums_controller.rb

  def index
    @albums = Album.all
---
SELECT * FROM `albums`

  def show
    @album = Album.find(params[:id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 1)

  def create
    @album = Album.new(params[:album])

    respond_to do |format|
      if @album.save
---
INSERT INTO `albums` (`created_at`, `title`, `updated_at`, `user_id`, `desc`) VALUES('2011-04-07 08:51:50', 'aasf', '2011-04-07 08:51:50', 1, '')