app/controllers/site_controller.rb

SELECT * FROM `albums`
---
  def home
    @albums= Album.all